Repository: estasi/validator
Catalog: locales/*/LC_MESSAGES/validators.po
Languages: ru

source: The data type is not valid. Expected: "%types%"!
ru: Недопустимый тип данных. Ожидался: "%types%"!

source: The checked value "%value%" is less than or equal to the minimum allowed value "%min%"!
ru: Проверяемое значение "%value%" меньше или равно минимально допустимому значению "%min%"!

source: The checked value "%value%" is less than the minimum allowed value "%min%"!
ru: Проверяемое значение "%value%" меньше минимально допустимого значения "%minRange%"!

source: Error when counting the number of elements in the value "%value%"!
ru: Ошибка при подсчете количества элементов в значении "%value%"!

source: The checked value "%value%" is greater than or equal to the maximum value "%max%"!
ru: Проверяемое значение "%value%" больше или равно максимальному значению "%max%"!

source: The checked value "%value%" is greater than the maximum value "%max%"!
ru: Проверяемое значение "%value%" больше максимального значения "%max%"!

source: The value is required and cannot be empty!
ru: Значение является обязательным и не может быть пустым!

source: The pattern must not be an empty string!
ru: Шаблон не должен быть пустой строкой!

source: An internal error occurred while using template "%pattern%"!
ru: Произошла внутренняя ошибка при использовании шаблона "%pattern%"!

source: The entered value "%value%" does not match the pattern "%pattern%"!
ru: Введенное значение "%value%" не соответствует шаблону "%pattern%"!

source: The checked value "%value%" is not an integer decimal number!
ru: Проверяемое значение "%value%" не является целым десятичным числом!

source: The checked value "%value%" is not a float decimal number!
ru: Проверяемое значение "%value%" не является десятичным числом с плавающей запятой!

source: The checked value "%value%" is not an octal integer!
ru: Проверяемое значение "%value%" не является восьмеричным числом!

source: The checked value "%value%" is not an integer hexadecimal number!
ru: Проверяемое значение "%value%" не является шестнадцатеричным числом!

source: The checked value "%value%" is not a binary integer!
ru: Проверяемое значение "%value%" не является двоичным числом!

source: The checked value "%value%" is not an number!
ru: Проверяемое значение "%value%" не является числом!

source: Email "%value%" is not correct!
ru: Email "%value%" не является корректным!

source: IP address "%value%" is not correct!
ru: IP-адрес "%value%" не является корректным!

source: An exception has been raised within the callback!
ru: В обратном вызове возникло исключение!

source: The input value "%value%" was not checked!
ru: Входное значение "%value%" не прошло проверку!

source: The checked value "%value%" is not a valid date!
ru: Проверяемое значение "%value%" не является допустимой датой!

source: The checked value "%value%" does not match the date format "%format%"!
ru: Проверяемое значение "%value%" не соответствует формату даты "%format%"!

source: The checked date "%value%" does not match the specified step "%step%" from the initial date "%startDate%"!
ru: Проверяемая дата "%value%" не соответствует заданному шагу "%step%" от начальной даты "%startDate%"!

source: The checked value "%value%" does not match the step "%step%" from the initial value "%startingPoint%"!
ru: Проверяемое значение "%value%" не соответствует шагу "%step%" от начального значения "%startingPoint%"!

source: A token was not found to compare the value!
ru: Не найден токен для сравнения с проверяемым значением!

source: The compared values "%value%" and "%token%" do not match!
ru: Сравниваемые значения "%value%" и "%token%" не совпадают!

source: The desired value "%value%" was not found in the list!
ru: Искомое значение "%value%" не было найдено в списке!

source: In the "%dataType%" data type, the number of elements cannot be counted!
ru: В типе данных "%dataType%" количество элементов не может быть подсчитано!

source: The checked uri "%value%" is not a valid uri with the specified verification settings!
ru: Проверенный uri "%value%" не является допустимым uri с указанными настройками проверки!

source: The checked uri "%value%" contains an invalid schema!
ru: Проверенный uri "%value%" содержит недопустимую схему!

source: The checked uri "%value%" contains an invalid host!
ru: Проверенный uri "%value%" содержит недопустимый хост!

source: The checked uri "%value%" contains an invalid port!
ru: Проверенный uri "%value%" содержит недопустимый порт!

source: The checked uri "%value%" contains an invalid path!
ru: Проверенный uri "%value%" содержит недопустимый путь!

source: The checked uri "%value%" contains an invalid query!
ru: Проверенный uri "%value%" содержит недопустимый запрос!

source: The checked uri "%value%" contains an invalid fragment!
ru: Проверенный uri "%value%" содержит недопустимый fragment!

source: The uri "%value%" being checked lacks a required scheme!
ru: В проверенном uri "%value%" отсутствует схема!

source: The uri "%value%" being checked lacks a required host!
ru: В проверенном uri "%value%" отсутствует хост!

source: The uri "%value%" being checked lacks a required path!
ru: В проверенном uri "%value%" отсутствует путь!

source: The uri "%value%" being checked lacks a required query!
ru: В проверенном uri "%value%" отсутствует запрос!

source: The uri "%value%" being checked lacks a required fragment!
ru: В проверенном uri "%value%" отсутствует фрагмент!

source: The checked uri "%value%" is not an absolute reference!
ru: Проверенный uri "%value% " не является абсолютной ссылкой!

source: The uri "%value%" being checked is not a network path reference!
ru: Проверяемый uri "%value%" не является ссылкой на сетевой путь!

source: The checked uri "%value%" is not an absolute path reference!
ru: Проверенный uri "%value%" не является абсолютной ссылкой на путь!

source: The uri "%value%" being checked is not a relative path reference!
ru: Проверяемый uri "%value%" не является относительной ссылкой на путь!

source: The checked uri "%value%" is not a relative reference!
ru: Проверенный uri "%value%" не является относительной ссылкой!

source: The checked value "%value%" does not match the UUID format!
ru: Проверяемое значение "%value%" не соответствует формату UUID!
